{
    "places_with_reviews": [
        {
            "name": "12 Jyotirling Temple",
            "rating": 4.2,
            "address": "56GP+9HQ, Valivali Gaon, Manjarli, Badlapur, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "This temple can be best visited at earliest sunrise or in the golden hour at sunset.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Being Mahashivratri 2024 not much crowd and easy accessible to reach in here Peacefully",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Awesome",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Very good one time visit",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "12 jyotirling Jai ho mahadev ki",
                    "languageCode": "en-US",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "visited best sunrise temple hour sunset golden earliest",
                "crowd reach peacefully mahashivratri much easy accessible",
                "awesome",
                "time visit one good",
                "mahadev jyotirling ho ki jai"
            ]
        },
        {
            "name": "Barrage River Point Badlapur",
            "rating": 4.3,
            "address": "5723+JGG, Badlapur Gaon, Badlapur, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "Best place to visit in summer season\nSafe place for play safe",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good place 😉..\nBut dangerous for with your group not alone and don't go in deeper side 🙂..",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "The best place to swim near badlapur kalyan. Google msg will not take you to the exact location so please take help from locals also wear full as it’s natural and u can get cuts here and there. Carry your dabba (tiffin) and just jump in the water and slide your worries away. Don’t go during rainy days the flow will take you along 😊",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "How to reach here\n1. Do not trust Google maps to the fullest ask some locals to reach till the end point\n2. You cannot take your vehicle to the end point rather you will have to park it 500m before and there is no vehicle security\n3. Strictly no 4 wheelers\n\nThe place is good to visit during late summer and start of rainy season it will be a bit of risky during rainy season\nDo carry extra clothes and towels in case you are planning for a bath\nThe sorrounding is a bit dirty and big thanks to visitors who are throwing chips packets and etc while leaving the place\n\nHow to enter in the water will be a big question if you are alone and you will definitely need some guidance to get into the center\n\nOverall I feel a great place to take bath on a Sunday morning\n\nIf you like fresh fishes there was a guy who was fishing there and sells them, I felt the price was a bit high but ofcourse you can bargaining\n\nAdding couple of pics here",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Nice and fun place with peaceful environment. Pls make sure you go at summer time to get the full enjoyment. If you go during other season the water will be above normal level and it will be a waste of time for you and your family.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "best season summer safe visit play",
                "deeper alone dont dangerous side good go group",
                "full location carry away exact slide swim u flow wear cuts also it dabba go google tiffin natural don water worries days jump along kalyan get t near badlapur best locals take rainy please s msg help",
                "maps wheelers question ask carry vehicle bath sorrounding ofcourse packets chips start felt strictly extra towels point definitely fresh price great high throwing late center thanks clothes couple security risky adding pics google overall feel water bargaining guy fishes summer park bit case dirty good big fullest get leaving sells trust morning season locals take alone reach end visitors etc enter guidance till rainy visit like planning need rather fishing sunday",
                "make full fun environment peaceful pls sure enjoyment family go water summer level waste nice time get season normal"
            ]
        },
        {
            "name": "Chikloli Dam",
            "rating": 4.4,
            "address": "56H6+CP5, Dattanagar, Badlapur, Ambernath, Maharashtra 421506, India",
            "reviews": [
                {
                    "text": "It is one of serene places in badlapur. Very well connected with city, still it has its own natural habitat existence. People go there for peace.\nIf you visit. Please do not litter the place. Do not disturb the others. Just enjoy the quiet place with yourself... Close your eyes and feel the air cleanse you... Visit is Eve time for sunset. It's very alluring...",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It was good but the transport is very weak. Just use your personal vehicle during the ride.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "It's peaceful serene beautiful place to visit through out the year 😀 in monsoon it becomes more alive n the views are mind blowing ❤️👌",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "The Chikloli Dam at Ambernath in the Badlapur region of Thane district, which is around 70 kilometers northeast of Mumbai. It is a concrete gravity dam and serves as a crucial water source for the surrounding areas, including parts of Mumbai.\n\nThe dam has a significant storage capacity, which helps in water storage and supply throughout the year. It plays a vital role in catering to the water needs of the local population, especially during the dry months and periods of water scarcity. The reservoir formed by the dam also contributes to the overall water security of the region.\n\nThe Chikloli Dam is known for its scenic surroundings and serves as a popular tourist spot for residents and visitors. People often visit the dam to enjoy its picturesque views and engage in recreational activities like picnicking, Fishing.",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "This place is beautiful. I wish we you visit this place keep clean do not throw plastics in water. I visited this place summer season .This place is very silent 😍 but sometimes MIDC sound desturb you.This place is surrounded by two sides one sides is Hills and forest and another side is MIDC. Mostly people are visit this place in rainy season. Very nice experience.",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "quiet peace disturb alluring cleanse air city eve go still natural feel close eyes existence places habitat people time sunset others well one badlapur enjoy litter serene visit please connected",
                "ride weak good vehicle transport personal use",
                "beautiful monsoon alive views serene becomes visit peaceful n blowing year mind",
                "helps supply often picnicking views parts picturesque kilometers serves source dam contributes concrete engage capacity gravity plays periods crucial activities chikloli also around including months security ambernath areas local storage surrounding overall significant water tourist catering role scarcity scenic recreational formed people year thane residents mumbai badlapur region vital needs dry surroundings enjoy known population visitors like visit spot throughout northeast reservoir popular especially fishing district",
                "wish sometimes keep throw beautiful visited experience forest silent surrounded plastics another midc sound mostly clean water desturb summer nice people youthis one season hills rainy visit side two sides"
            ]
        },
        {
            "name": "perrigo waterfall",
            "rating": 4.5,
            "address": "5683+4XF, Unnamed Road, Ambernath, Maharashtra 421506, India",
            "reviews": [
                {
                    "text": "I can't believe there is such lovely nature in a bustling city. Very beautiful nature and a quick trip to the waterfall is great. However, only drunk people come here and hurl glass bottles there. If you plan to visit, please be careful.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Hidden and peaceful waterfall in Ambernath. A good place to visit with friends and family.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "So beautiful but surrounded by Industries.\nIf you visiting this place, make sure you don’t litter.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It's could be your personal waterfall if you visit on weekdays",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Lovely place,mini but beautiful waterfall.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "drunk waterfall hurl plan nature beautiful quick great city cant bustling glass however lovely believe trip people careful come visit please bottles",
                "waterfall friends hidden peaceful visit family good ambernath",
                "beautiful visiting make litter surrounded sure industries t don",
                "waterfall weekdays visit personal could",
                "beautiful waterfall placemini lovely"
            ]
        },
        {
            "name": "Badalapur Railway Station",
            "rating": 3.9,
            "address": "56HF+F53, Sarvodaynagar, Katrap, Badlapur, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "Worst gardi ever",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Best hotel",
                    "languageCode": "en",
                    "rating": 3.9
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 3.9
                }
            ],
            "preprocessed_reviews": [
                "worst gardi ever",
                "best hotel",
                "good"
            ]
        },
        {
            "name": "Sarvodaya Nagar, Temple",
            "rating": 4.2,
            "address": "56QC+Q37, Jambhul Rd, Dattanagar, Ambernath, Maharashtra 421505, India",
            "reviews": [
                {
                    "text": "Very beautiful temple of Shri Radha Krishna. Nicely decorated interiors. Within a society compound but anyone can come and visit. Place to find some peace.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "The Hindu temple is a part of Sarvoday Nagar an  upcoming locality between Ambernath and Badlapur. It's made from red granite stone. The architectural design is kept minimal. To the extent that it brings out the essence of a Hindu temple. The temple artists are working at very slow pace. Hopefully it should be ready by February end.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Newly built and maintained properly. Regular aarti by 7:30 pm.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Good place but far from Ambernath and Badlapur Station",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "I am living in sarvodaya nagar but still not visited",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "beautiful krishna peace shri within temple interiors come radha society find visit anyone decorated nicely compound",
                "architectural temple red made sarvoday minimal essence hindu artists stone pace nagar locality ready ambernath granite february slow design badlapur end brings part hopefully upcoming working kept extent",
                "properly pm built regular aarti maintained newly",
                "badlapur far station good ambernath",
                "visited nagar living sarvodaya still"
            ]
        },
        {
            "name": "Satsang Vihar Badlapur",
            "rating": 4.6,
            "address": "56CW+WV7, near SATSANG VIHAR, Hendre Pada, Badlapur, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "Satsang is a peaceful place. I use to visit Satsang in Childhood, same vibes. Needs proper maintaince of ground. Must visit during pravachans.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very good environment surrounded by mango, cheeku, flowers and others also. This is basically made for shree shree Thakur. Good time to spend in this garden.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "A one day camp at this close to nature temple made me a fan of this beautiful place spread over 27 acres of land. Primarily visited for prayers, this temple cultivates seasonal fruits and vegetables organically. Some part of the harvest is used by the in-house people and the  rest is available for the public. Those who are interested to purchase such natural fruits and vegetables can connect to me for further details.\n\nWhilst outsiders are not allowed, one of our teachers who is a member of the temple let us in and stay for the entire day.\n\nAn enriched day in my life with my NSS students who cleaned the premises and contributed their efforts for enhancing the beauty of the premises.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "It's very wonderful and natural place. There is a temple which is devoted to sri sri thakurji. The temple contains gardens with flowers and fruits. Very satisfying and refreshing place. It is a place must visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Peace of mind. Thakur ji bless all ..... Calm.. surrounded with nature....  Temple timings evening post 5 pm. Around 6 prayer happens . Prayer time varies every month... The place is one of the major attraction in badlapur....",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "needs vibes ground proper satsang peaceful visit must pravachans maintaince childhood use",
                "flowers garden shree time spend also environment thakur made surrounded good others basically cheeku mango",
                "camp vegetables enhancing temple beauty efforts made connect day seasonal public rest whilst harvest nature beautiful primarily visited stay fruits entire land teachers let cultivates life allowed natural available cleaned enriched outsiders close member us prayers people students premises fan organically one purchase contributed spread details used part inhouse acres interested nss",
                "flowers fruits temple natural wonderful gardens visit must thakurji satisfying refreshing contains devoted sri",
                "ji post peace happens major temple varies timings bless nature prayer surrounded around month every evening pm time attraction one calm badlapur thakur mind"
            ]
        },
        {
            "name": "Shree Swami Samarth Mandir (Dindori Pranit)",
            "rating": 4.8,
            "address": "5762+X8P, Evershine Cooperative Housing society, Rameshwadi, Badlapur, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "Swami Samarth Temple in Rameshwadi area of Badlapur. Well maintained and clean. Lot of devotees visit temple to seek Swami ashirvad. Very silent inside and one can do meditation Any time.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Shree swami Samarth.. Nice and peace place, We Every Sunday going there.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's a Swami Samarth Temple. Good place for meditation.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "One of best places I have visited in Badlapur.\nCool atmosphere.\nDivine feeling.\nPeaceful premises.\nI love this place very much.\n🙏🙏🙏Shri Swami Samarth Maharaj ki jai 🙏🙏🙏",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's place of positivity your all wishes comes true\n🙏🏻Shri swami smarth🙏🏻",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "temple samarth silent lot seek clean area rameshwadi devotees time ashirvad well one badlapur meditation swami visit maintained inside",
                "every peace shree swami nice samarth sunday going",
                "samarth meditation temple swami good",
                "love peaceful much jai samarth atmosphere visited ki places divine premises one badlapur best shri swami cool feeling maharaj",
                "positivity true shri swami smarth comes wishes"
            ]
        },
        {
            "name": "Shiv Mandir Shrishti Hill (Near Sices college)",
            "rating": 4.6,
            "address": "Chikhloli, Road, Dattanagar, Ambernath, Badlapur, Maharashtra 421505, India",
            "reviews": [
                {
                    "text": "Nice place.. Shiv temple on the  hill ... Big shiv pind on temple...  zero crowded area",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice location surrounded by lush green hills. Calm and quiet atmosphere.\nShiv temple # hindu#\nGood place to visit at evening time with family.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice Location, surrounded by nature, hilly area, you can find peace over here, around greenery, no noise of vehicles, no pollution, best time to visit after monsoon, cz at that time you can see most beautiful view of this location.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Enjoyed a lot going there by cycle... Nice view of Chikhloli dam...",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "shiv area temple hill nice zero big crowded pind",
                "quiet shiv calm green location hills temple good time nice surrounded visit lush atmosphere family evening hindu",
                "peace noise location nature beautiful cz surrounded around monsoon area vehicles view nice find time greenery best hilly visit pollution see",
                "good",
                "view cycle nice enjoyed chikhloli dam lot going"
            ]
        },
        {
            "name": "Bhoj dam",
            "rating": 4.8,
            "address": "Bhoj Dam, Maharashtra 421503, India",
            "reviews": [
                {
                    "text": "It's the safest and the most beautiful dam in badlapur.\n\nVegetation around is as mesmerizing as the mountains that greet us.\n\nDon't forget to feed the fish that swim around the rocks.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's fantastic spot with no crowd location 📍 it's best self time spot ☺ which is located near komdeshwar temple badlpur. Here the reflection of mountain range in dams water was fabulous. Tried capture lots of things from there. There is lots various types of flowers which keeps you fresh Nd energetic.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Went here by car.. location is easy to find. 200/300m Walking to reach dam from parking.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's a awesome place.. you can visit Dam 🦫 In Rainy season as well as in Initial winter month..",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A great place to calm and away from city chaos..",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "beautiful badlapur feed safest greet dont fish mountains rocks us around mesmerizing dam swim vegetation forget",
                "tried flowers keeps types location temple range mountain badlpur crowd fresh located komdeshwar lots fantastic things fabulous water energetic dams reflection time near best capture spot self various nd",
                "walking location parking reach find went car dam easy",
                "season awesome visit rainy month dam winter initial well",
                "calm chaos great away city"
            ]
        }
    ]
}