{
    "places_with_reviews": [
        {
            "name": "Krishna Mutt",
            "rating": 4.8,
            "address": "V2WV+H4C, Amtady, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "One of best place to visit in udupi anytime .\nEspecially evenings the best time over here",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Historical place filled with positive vibes .\nMust visit place in Udupi.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's one of the best spiritual places\nYou will get peace  once you enter Rathabeedhi.\nLots of shops are there shopping\nParking is available and luggage room also available.\nAnanteshwara, Chandramouleshwara and  Ragavendra Swamy  temple must visit places at Rathabeedhi.\n\nYou will get afternoon lunch as a prasdha\nUsually crowd is too much in weekend ans special days\nHave to stand in Queue for at least 1 hour if you are planning to take darshana in the morning around 8 to 9 AM.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The temple is beautiful.\nThere are many Mutt.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Mesmerizing experience at the evening aarti !!!\n\nWe went at 6.00pm , very less crowd, we had the most amazing experience. The evening ritual ( seva) starts at 6.30 pm , they light hundreds of diyas in the mandir and the evening Aarti enfolds accompanied by lots of musicians playing traditional musical instruments. Post that the deity is taken in a palaquin( palkhi) around the Krishna mutt. Then on the boat in the sarovar all accompanied by the procession of musicians. This around 7.30 pm . Post that the diety is kept on huge almost 30 feet raths , pulled by the devotees .The raths are beautifully illuminated!!! There is traditional Indian music being played. It's a mesmerizing experience. This happens DAILY (except the monsoons ) . This tradition is going on for centuries. It's like time has stopped here, centuries ago ,terms of rituals and traditions being followed. The ambiance too is amazing",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "best udupi visit evenings time especially anytime one",
                "vibes udupi visit must filled historical positive",
                "peace spiritual ananteshwara temple much weekend chandramouleshwara prasdha ragavendra luggage rathabeedhi crowd lots parking also lunch around hour room special available darshana shopping least places must afternoon ans days stand get shops one morning best take usually queue enter swamy visit planning",
                "temple many mutt beautiful",
                "happens post daily sarovar taken diety except light almost seva went amazing instruments pulled rituals stopped enfolds palkhi diyas krishna crowd experience monsoons lots beautifully going ago followed palaquin starts around music ritual boat huge raths ambiance accompanied evening illuminated played centuries indian pm traditional mesmerizing devotees time tradition deity procession hundreds musical traditions playing like aarti mutt terms mandir musicians feet kept less"
            ]
        },
        {
            "name": "Bantwal",
            "rating": 4.4,
            "address": "W22R+GFC, Bantwal, Amtady, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "Only one place in Karnataka which is undeveloped because of narrow roads . Main roads were encroached",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "We love Karnataka India",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "No issue. I went to Market",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Super 😍",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Need a lot of maintenance",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "roads karnataka narrow encroached main one undeveloped",
                "karnataka india love",
                "market issue went",
                "super",
                "lot maintenance need"
            ]
        },
        {
            "name": "Shri Tirumala Venkataramana Swamy Temple",
            "rating": 4.8,
            "address": "Bantwal Market Rd, Bantwal, Amtady, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "This is a divine place to visit as a bhaktha. When you see the lord Tirumala swami, who is famously known as \"Vatapuresha\"🙏🙏, you will be very emotional with full of bhakti towards him. It is a Old ancient temple  with vast beautiful Netravati river behind the temple. Famous thing in this temple is 'Bantwala Mrigabete' and 'Bantwala Rathotsava', where lot of bhakthas visit this temple with famous jasmine flower to God. This is one of the famous and powerful  temple of GSB community❤.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Bantwal Sri Tirumala venkatramana temple on the banks of river nethravathi built in a unique architectural style by the local GSB Community is a real Marvel in its stature as well in Beauty & Divinity.The Lord Venkatramana is also popularly called as Vatapuresha and is the Ishtadevatha for the local Konkani speaking community which population is more of Baligas.People throng this temple during Lalki utsav and theru.Offering Jasmine flower during these utsav is so beautiful fragrant and divine.Thanks to the GSB community who are continuing the age old tradition without any compromise on the customs and  the sanctity of the temple as a whole.Bantwala grama devu venkatesha raakha thu.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "this is a very old temple around 15th century temple of Sri Thirumala Venkataramana Swamy. the temple complex is big . The deity is very nicely decorated and the worship is done with great devotion. The temple has sub-shrines to shri Garuddev, shri Hanuman, Goddess shri Lakhsmi and shri ganesh. the structure is old and the old structure is maintained.\n\nA temple which one should visit when one visits temple in this area.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Peaceful and spiritual place right next to netravati river with lots of fishes and can spend time at River side.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A very old temple belonging to the community of GSB Konkani speaking community built somewhere in the 16th century",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "full bhaktha river vast temple towards gsb old famous beautiful tirumala famously mrigabete netravati thing lot behind ancient flower bhakti bhakthas god lord bantwala divine jasmine powerful one emotional rathotsava swami known visit see vatapuresha community",
                "architectural real river age temple beauty popularly gsb stature called utsav thu old beautiful tirumala raakha unique nethravathi bantwal also baligaspeople konkani divinethanks compromise wholebantwala devu divinitythe local fragrant speaking sanctity style flower sri without venkatramana lord customs grama built marvel tradition theruoffering jasmine well banks continuing throng venkatesha lalki population ishtadevatha vatapuresha community",
                "subshrines temple thirumala garuddev worship visits structure devotion old great century around th nicely venkataramana area lakhsmi goddess big decorated one deity shri done swamy visit hanuman maintained ganesh complex sri",
                "river lots right fishes spend spiritual netravati next peaceful side time",
                "temple somewhere century gsb konkani built th belonging speaking old community"
            ]
        },
        {
            "name": "Church Of Most Holy Saviour, Agrar",
            "rating": 4.6,
            "address": "Ponnangila, Ponnagila, Agrar Post via Bantwal, Post via, Agrar, Bantwal, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "The church was built in 1702,\nIt is the one of the oldest churches in Dakshina Kannada district.\n\nThe exterior of the Church Of Most Holy Saviour stands as a testament to the craftsmanship and dedication that went into its construction. The intricate architecture and the majestic bell tower create a visual symphony of faith and artistry. It's a sight that captures the essence of the divine even before stepping inside.\n\nthe Church Of Most Holy Saviour in Agrar, Bantwal, is not just a place of worship, but a sanctuary of solace and devotion. It's a place where one can connect with the divine, find comfort in a supportive community, and experience a profound sense of spirituality. Whether you're a devoted believer or simply seeking a moment of inner peace, a visit to this church promises an encounter with the sacred that will resonate long after you've left its sacred halls.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Most Holy Saviour church is in Agrar, Bantwal Taluk. One of the oldest churches in Mangalore Diocese.\nThe paintings on the ceiling near the Alter are very beautiful.\nAn outdoor hall is being constructed this year(2018) which will be probably open for the benefit of the parishioners by this December.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "One of the oldest church in Mangalore.\nVery good place for prayer.\nParking facility is available.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice church it also has a 300 years old history initially it has been built by British and later it was rebuilt. Inside this church there are many statues and paintings on the wall. It has a big ground and parking lot. It has its own schools. It's an good place, nice and pollution free environment.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "One of the ancient churches of Mangalore. Beautiful paintings are found here like st Aloysius College Chapel. Visit once to experience the peace of mind.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "dedication sight even profound peace kannada captures believer long connect encounter went testament intricate worship stands oldest solace majestic devotion essence saviour resonate exterior experience youre create sanctuary simply bantwal inner church visual seeking supportive sense devoted craftsmanship architecture bell artistry youve holy built divine agrar find promises halls inside one comfort dakshina moment community churches tower whether sacred visit left construction faith spirituality district symphony stepping",
                "taluk benefit diocese oldest ceiling saviour beautiful bantwal december church paintings mangalore hall alter parishioners constructed probably open holy agrar year near one churches outdoor",
                "available prayer parking good church mangalore oldest facility one",
                "environment old many parking also church later rebuilt paintings lot schools years initially wall british nice built free big good history ground statues pollution inside",
                "beautiful peace experience college churches like mind visit chapel paintings mangalore one found st aloysius ancient"
            ]
        },
        {
            "name": "Brahmashree Narayanaguru Mandira B.C.ROAD",
            "rating": 4.4,
            "address": "Jodu Marga, BC Road, V2PM+3RF, Ganadapadpu, Mangalore, Bantwal, Karnataka 574219, India",
            "reviews": [
                {
                    "text": "Temple of shree Brahmashree Narayanaguru, nice place architecture is also beautiful  we can find Brahmashree Narayanaguru Hall attached to mandir, hall is also quite good and best for marriage, hall rent is also appordable, parking is a issue here",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "🙏",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Good place,  parking is the problem",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Good place",
                    "languageCode": "en",
                    "rating": 4.4
                },
                {
                    "text": "Wonderful place",
                    "languageCode": "en",
                    "rating": 4.4
                }
            ],
            "preprocessed_reviews": [
                "temple brahmashree rent appordable beautiful parking quite also hall marriage architecture nice find narayanaguru good shree best attached issue mandir",
                "",
                "parking problem good",
                "good",
                "wonderful"
            ]
        },
        {
            "name": "Gokarnanath Temple",
            "rating": "Unknown",
            "address": "V2PM+2PX, Ganadapadpu, B.C Road, Bantwal, Karnataka 574211, India",
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Holedande Shri Mahalingeshwara Devastana",
            "rating": 4.9,
            "address": "V2VR+XH7, Main Road, Bantwal, Amtady, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "One of the beautiful temple... Located nearly river Netravathi... Very famous bus it's own performance... I spent more years here for my studies function etc etc...\nAnnual festival will be held from Mesha Sankraman... I. e April 14-19 it may differs",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "A small silent town situated along the Nethravati river with some really old Temples. A must visit place on the way from Bangalore the Mangalore",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Very cool and silent place🙏and good view of river nethravathi..",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Very old and beautiful temple",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Peace",
                    "languageCode": "en",
                    "rating": 4.9
                }
            ],
            "preprocessed_reviews": [
                "studies river temple april differs famous beautiful e held located may sankraman years festival spent one annual netravathi etc nearly function mesha performance bus",
                "situated river temples nethravati bangalore small silent visit must way old really along mangalore town",
                "river nethravathi view cool silent and good",
                "beautiful temple old",
                "peace"
            ]
        },
        {
            "name": "River view point",
            "rating": 4.6,
            "address": "W324+6CF, Bantwal, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "Nice view point of the Netravati river just on the side of the main road from Bantwal to Beltangady. Now there seems to be some bridge or dam construction in progress in this place so view is slightly disturbed also be careful of a steep sudden drop in the end of the view point.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Located in the bantwal Dharmasthala highway\nIt's a bridge where you can see a landscape view of the netravati river\nThere is also a pump house here\nIf you are passing by this highway you can stop for a few minutes and enjoy the view of the river\nBest during monsoon when the river is full",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Gem of a place in the middle of nowhere! The problem is it's very easy to miss as you are driving on the highway from BC road to Belthangadi, and this beautiful view will escape you in a fraction of a second. Better to visit early morning, and excellent photography opportunity. Great picnic space too. But be careful not to disturb the natural ecosystem and the HW by the side. Park your car in a safe place and keep an eye on your children.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Nice places",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "river sudden road dam slightly disturbed point bantwal also netravati view nice seems main steep bridge careful end drop side construction beltangady progress",
                "full house river landscape located stop bantwal also netravati highway passing pump minutes monsoon view dharmasthala bridge enjoy best see",
                "picnic disturb gem eye road problem children keep beautiful great safe fraction highway escape middle natural bc opportunity view second park hw excellent better belthangadi nowhere space morning early driving miss careful photography visit side car easy ecosystem",
                "good",
                "places nice"
            ]
        },
        {
            "name": "MANTRA DEVATE SANIDYA",
            "rating": 4.9,
            "address": "V2PX+3PM, Poithaje, Karnataka 574231, India",
            "reviews": [
                {
                    "text": "MANTRA DEVATE SANIDYA the place beside the river netravathi, Pradeep swami the man behind the scene.. ultimate place to know what's going on in your life..\nThe past , rectification for a better future..(astrology at its best)\n\nThis is the right place to visit..",
                    "languageCode": "en",
                    "rating": 4.9
                },
                {
                    "text": "Swami appe ... Kapule",
                    "languageCode": "en",
                    "rating": 4.9
                }
            ],
            "preprocessed_reviews": [
                "pradeep river beside sanidya whats going right devate life behind ultimate mantra better scene man best rectification netravathi know swami past visit futureastrology",
                "kapule swami appe"
            ]
        },
        {
            "name": "Badr Juma Masjid Tippu Nagara Loretto padav",
            "rating": 4.6,
            "address": "W29W+6QH, Mother Teresa Rd, Loretto, Karnataka 574211, India",
            "reviews": [
                {
                    "text": "Like",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "BJM tippu nagara",
                    "languageCode": "en-US",
                    "rating": 4.6
                },
                {
                    "text": "God bless",
                    "languageCode": "en-US",
                    "rating": 4.6
                },
                {
                    "text": "Masha Allah",
                    "languageCode": "en-US",
                    "rating": 4.6
                },
                {
                    "text": "Mashallah",
                    "languageCode": "en-US",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "like",
                "nagara bjm tippu",
                "god bless",
                "masha allah",
                "mashallah"
            ]
        }
    ]
}