{
    "places_with_reviews": [
        {
            "name": "Lambhvel Hanumanji Temple",
            "rating": 4.8,
            "address": "Nadiad-Anand Rd, Purushottam Nagar, Lambhvel, Gujarat 388315, India",
            "reviews": [
                {
                    "text": "Shree Lambhvel Hanumanjji\n\nLambhvel village is located just 2 Km of Anand city Gujarat. This village is famous for Swayambhu Lord Hanumanji Temple. It is a centre of faith since long time in and around Anand. This temple is located on Anand - Kanjari Road in huge campus with lot of facilities for devotee and tourist. The idol of lord Hanumanji is Swayambhu attracts thousands of devotee throughout the year and especially on Saturday and Tuesday. on Kali Chaudas, day before Diwali, a huge fair is held at Hanumanji temple of Lambhwel where thousands of devotee from nearby area visit with great faith and devotion.\n\nSwayambhu Hanumanji Mandir located at small village Lambhavel just 2 km away from Anand, Gujarat is centre of faith since long time in surrounding area of Anand. This temple is located on Anand – Kanjari Road in huge campus with lot of facilities for devotee and tourist. The idol of Lord Hanumanji is Swayambhu – Spontaneous with divine power which attracts thousands of devotee throughout the year and especially on Saturday and Tuesday. Temple trust manages the huge campus along with the ceremony hall where function can be arranged. Apart from this temple manages various social, cultural, religious, medical related activities for general public of nearby area. On Kali Chaudas, day before Diwali, a huge fair is held at Hanumanji temple of Lambhwel where thousands of devotee from nearby area visit with great faith and devotion. Lot of devotee reach here on feet as per the wish and faith.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Very good environment inside the temple also there is nicely architectural building which enhance the look of temple and attracts more visitors and when it was decorated it looks so beautiful",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Jai Jai shree ram 🚩 I must recommend to visit lambhavel Hanuman ji temple.never ever any reason for compair hanumanji with other things we are not able to give any appreciation for that environment it's truly spritual,and RAMMAY .I love hanuman ji lambhavel whole aarti. Ram Lakshman janki Jai bolo Hanuman ki 🚩🙏🙏🙏",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Jay shree hanuman Dada\nBest hanuman temple in lambhvel\nIt is very old temple but so real\nWe visit here every week and take blessings\nSo many people visit here every day but specially on Tuesday and Saturday\nVibe is so pure\nPacking is available",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A place of spiritual significance, the temple of Lord Hanumanji Dada, has been standing for five centuries, radiating holiness.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "hanumanjji away wish lambhvel religious huge spontaneous hall nearby area attracts time lambhavel social idol cultural apart temple faith devotion ceremony public held hanumanji activities village great lot surrounding tourist lambhwel gujarat small divine anand kali manages visit chaudas arranged medical long road facilities famous city saturday power fair along general tuesday throughout mandir feet km campus kanjari day swayambhu located related centre around diwali per devotee since lord year trust shree thousands reach function various especially",
                "architectural beautiful building temple also environment visitors enhance attracts looks look good decorated nicely inside",
                "ji love templenever environment jai appreciation recommend hanumanji compair janki rammay spritualand things give ram truly able ever ki must bolo whole shree reason lakshman lambhavel visit hanuman aarti",
                "real temple day vibe old jay many lambhvel every available dada saturday people tuesday week packing best shree take visit pure hanuman blessings specially",
                "centuries hanumanji dada temple spiritual standing lord significance radiating holiness five"
            ]
        },
        {
            "name": "ISKCON Vidyanagar(Sri Sri Radha Giridhariji)",
            "rating": 4.7,
            "address": "GWXF+844, Iskcon Rd, opp. B&B Polytechnic College, Mota Bazaar, Vallabh Vidyanagar, Anand, Gujarat 388120, India",
            "reviews": [
                {
                    "text": "The most beautiful and alive idols of Radha-Giridhari I have ever seen. I was not able to shift my eyes anywhere once I see lord Radha Krishna. 🙏",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Sweetest deities & lovely little temple. So wonderful to hear they will be constructing a larger temple to accommodate the huge numbers during the festivals! Sri Sri Radha Giridhari ki jai 🙌",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "To experience spiritually of Iskcon in Vidyanagar, you must visit here. Witness Mesmerizing idols of Sri Radha Giridhari ji. This photos taken on the day of Hindu new year. On this day you can take prasadam of Maha Annakoot. Parking is available on main road.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Religious place. Nice and holy ambience. Very good decorations.Parking is not available. Very tasty kichdi is served as prasad on Sunday. Apart from temple one good restaurant is there beside temple which is managed by Temple staff. Food available is very nice and cost effective also.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Very small but beautiful temple..Always welcome if you want to feel the love and peace...",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "beautiful krishna alive eyes anywhere lord able ever radha radhagiridhari see idols seen shift",
                "deities larger sweetest temple festivals radha wonderful constructing ki little huge jai giridhari hear accommodate numbers lovely sri",
                "ji taken road day vidyanagar photos giridhari hindu experience maha parking witness annakoot iskcon new prasadam available radha must mesmerizing main year take visit spiritually idols sri",
                "apart staff temple restaurant beside kichdi religious effective also tasty available served ambience decorationsparking nice holy good food one prasad managed cost sunday",
                "welcome beautiful peace love want small templealways feel"
            ]
        },
        {
            "name": "Atmiya Vidhya Dham (AVD)",
            "rating": 4.8,
            "address": "Bakrol Rd, behind GCET College, Tirath Society, Mota Bazaar, Vallabh Vidyanagar, Anand, Gujarat 388120, India",
            "reviews": [
                {
                    "text": "I visited this Atmiya Vidhya Dham (AVD), Bakrol, Anand. An excellent example of science and spirituality, where you will get pure peace and feel your self so calm. One of the finest campus where lush green area, Lord Swaminarayan Mandir, Sant Niwas, Big dining area, College with Hostel for boys and huge parking space. Whenever you visit this campus and prayer in the temple you just felt some kind of inner peace and calmness. Must visit and Jay Swaminarayan.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Atmiya Vidhya Dham Bakrol Temple offers a serene and spiritually uplifting experience for visitors seeking a place of worship and reflection. Nestled in a tranquil setting, this temple provides a peaceful retreat from the hustle and bustle of daily life.\n\nThe temple's architecture is a blend of traditional and modern elements, creating a unique ambiance that resonates with both devotees and architecture enthusiasts. The intricate carvings and attention to detail in the construction showcase the dedication of the artisans who brought the temple to life.\n\nVisitors are greeted with a sense of tranquility as they enter the temple premises. The well-maintained gardens and pathways provide a soothing environment for introspection and meditation. The temple's design encourages a sense of reverence, making it an ideal place for devotees to connect with their spirituality.\n\nDevotees often praise the serene atmosphere within the temple complex. The peaceful ambiance allows individuals to engage in prayers and rituals with a focused mind. Regular religious ceremonies and events are conducted, further enriching the spiritual experience for those who participate.\n\nThe temple's community involvement is commendable, as it often organizes charitable activities, educational programs, and cultural events that contribute positively to the local community. This dedication to service aligns well with the temple's mission of fostering spiritual growth and holistic development.\n\nWhile Atmiya Vidhya Dham Bakrol Temple offers a tranquil and spiritually enriching environment, some visitors might find the facilities and amenities to be more basic compared to larger or more established temples. Additionally, the temple's popularity can lead to relatively crowded conditions during peak visiting hours.\n\nIn conclusion, Atmiya Vidhya Dham Bakrol Temple is a place where spirituality and tranquility converge. Its unique architecture, serene ambiance, and community-focused initiatives make it a destination worth visiting for individuals seeking a respite from the demands of modern life and a chance to reconnect with their inner selves.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "The perfect blend of education and spiritually, as soon as you enter here you can feel great vibes. This place was especially made for students of Vidhya Nagar, who came here for their studies they can stay here.\n\nThe main Attraction is beautiful white marble temple in center and huge open lawn in front of it.\n\nParking is also available here for visitors.\n\nBest time to visit here is in the evening. You can feel nature all around you.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "It's a Divine College and Hostel for the youngsters, you will find the Peace here and you will experience the holy divine peace soul for your mind, The sculpture of the temple is awesome and unique, here the Playground for the students and all type of sports zones are here, they nurture the children for the mind and body fitness both, and the best thing is that they also nurture the kid like a mother",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "✅Very well maintained premises. Spiritual environment, opportunity to uplift the soul, friendly staff, better guidance than any where else.\n\n🚫Don’t recommend for those who have an allergy of good and spiritual friends.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "peace campus college green atmiya science temple hostel swaminarayan dining lush felt jay visited whenever prayer example parking inner niwas vidhya huge boys feel calmness avd area dham lord excellent finest must big space get kind one anand calm sant bakrol pure visit self mandir spirituality",
                "daily dedication selves atmiya contribute events ceremonies worship rituals greeted tranquil engage programs established visiting uplifting popularity allows religious blend compared peak vidhya local life focused attention showcase pathways converge architecture detail worth dham prayers devotees service participate modern well involvement mission relatively visitors enriching enter bakrol conditions respite brought chance often cultural creating temple environment introspection intricate amenities wellmaintained charitable positively unique activities bustle lead sense fostering traditional additionally destination communityfocused nestled make enthusiasts development peaceful facilities tranquility atmosphere demands experience within inner educational seeking conclusion artisans larger temples hours gardens find provides reflection premises reverence commendable holistic ideal might meditation conducted serene retreat organizes basic making complex mind community initiatives carvings spiritual hustle connect individuals praise regular ambiance crowded growth provide soothing encourages offers design reconnect elements spiritually construction setting aligns spirituality resonates",
                "education studies temple made soon perfect came nature beautiful stay parking great nagar also blend center around vidhya huge evening feel available open students main lawn time attraction white best vibes visitors enter visit marble spiritually front especially",
                "peace college temple hostel children experience unique also type nurture body thing playground kid find holy divine students mother best youngsters sports fitness like awesome soul sculpture zones mind",
                "staff spiritual friends environment else recommend uplift don opportunity allergy friendly better premises good well t guidance soul maintained"
            ]
        },
        {
            "name": "VALASAN MANDIR",
            "rating": 4.5,
            "address": "HV2J+PXH, Valasan, Gujarat 388325, India",
            "reviews": [
                {
                    "text": "My photo shoot 📸",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Nice Hindu temple",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Best peace full place and beautiful...what a engraving in the place...best art and design and world famous temple...\nMeldi maa most popular temple..🚩\nJay maa meldi...🚩🙏🏻😍",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Very good",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Feel blessed when I visited at the temple and the greatest thing is that they are building new temple and it's so big and lovely",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "shoot photo",
                "temple hindu nice",
                "famous full peace best world jay maa temple beautifulwhat meldi art engraving placebest popular design",
                "good",
                "visited building greatest temple new thing big blessed lovely feel"
            ]
        },
        {
            "name": "Bh V K Auto parts",
            "rating": 4.3,
            "address": "Mota Bazaar, Vallabh Vidyanagar, Anand, Gujarat 388120, India",
            "reviews": [
                {
                    "text": "Bhaikaka circle is place in VVN where we can have options to do shopping or eat outside or going towards railway station or bus station by Auto or city bus. Gujarat transport ST buses and travels used to Stop here for pickup and drop. It is not far from Town hall or Anand New busstand.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It’s a roundabout. And a very busy one at that.\n\nTraffic is hectic here unless there are traffic police in the area. Cars, buses, bikes, trucks cows all mingling  together to get past each other and hardly anyone wants to stop.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Value for time",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Traffic is the one problem...otherwise it is good.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "One the busiest road or circle in city. You will see traffic in morning in-between 7 to 9 and after 6 to 8 pm.",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "bhaikaka buses towards going town vvn eat stop circle city station busstand new hall railway shopping gujarat travels options outside pickup transport anand far used drop auto st bus",
                "traffic buses cars bikes together trucks stop it roundabout cows police anyone area wants get one hardly hectic unless past s busy mingling",
                "time value",
                "problemotherwise good traffic one",
                "morning traffic circle busiest pm road city inbetween see one"
            ]
        },
        {
            "name": "BAPS Shri Swaminarayan Mandir",
            "rating": 4.8,
            "address": "Goya Talav, HX33+8VJ, Mathiya Chora, Anand, Gujarat 388001, India",
            "reviews": [
                {
                    "text": "Must visit temple if you are visiting Anand.\nAmazing, Spiritual & peaceful atmosphere. You can enjoy delicious, quality & quantity food at Premvati.\nAlso surrounded by other temples like Amba mata, Jalaram, Hanuman ji, Shivji, Gayatri mata etc.\n\nAbout Temple :-\nAn iconic landmark of Anand, the temple is a place of fervent devotion and piety. The Swami Narayan Mandir is the famed six storeyed building which draws huge crowds to its doors.\n\nThe temple is built with an architectural magnificence like no other and is soothing to the eyes. The temple is very popular in the region for its beauty, for its deity and its religious significance. Some of the deities presiding over the temple and being worshipped here include Narayan Lakshmi, Harikrishna Maharaj, Guru Parampara and Ghanshyam Maharaj.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Must visit temple if you are visiting Anand, nice & peaceful atmosphere. Premvati is also located nearby. Also surrounded by other temples like Amba mata, Jalaram, Hanuman ji, Shivji, Gayatri devi etc.\n\nParking is available too.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "A place where you can get relief like all other Swaminarayan temples throughout Gujarat .\nNice temple but a little bit smaller as compared to other Swaminarayan temples I have seen.\nReligious and calm place to stay .",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "DIVINE PLACE APC VVNAGAR. MUST PLACE TO VISIT N FEEL PEACE. N DIVINITY . NICE HOSTEL FOR BOYS ONLY. GOOD MANAGEMENT BY BAPS SAINTS EXPERTS VOLUNTEERS N ELDERS. EXCELLENT HEALTHY VEG.FOOD FOR STUDENTS N NICE MANDIR FOR PRAYERS N SPIRITUAL UPLIFTMENT. GR8 PLACE. I LOVE APC MY HOME.\n\nJAY SWAMINARAYAN",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "This is very holy place. Must visit. Very famous in the anand. Location is very nice. Near Goya તળાવ. Center point.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "ji architectural amba deities harikrishna temple spiritual beauty shivji peaceful amazing fervent atmosphere devotion ghanshyam narayan visiting include quality gayatri piety religious also jalaram surrounded landmark huge six presiding mata soothing temples premvati eyes magnificence built must delicious significance lakshmi food famed doors anand enjoy building region deity etc swami storeyed parampara like visit worshipped hanuman crowds popular quantity iconic maharaj guru draws mandir",
                "ji amba temple shivji peaceful atmosphere visiting located gayatri parking also jalaram surrounded devi available mata nearby temples premvati nice must anand etc like visit hanuman",
                "calm gujarat stay temples temple religious nice like bit swaminarayan relief little throughout compared get seen smaller",
                "peace love spiritual hostel swaminarayan divinity jay gr management home baps vvnagar boys feel apc experts nice n must divine excellent healthy students good prayers volunteers saints vegfood elders visit mandir upliftment",
                "famous anand point location goya center nice holy visit must near"
            ]
        },
        {
            "name": "Anoopam Mission",
            "rating": 4.6,
            "address": "Brahmajyoti, Yogiji Marg, Mogri, Anand, Gujarat 388345, India",
            "reviews": [
                {
                    "text": "The temple was well-maintained and spacious enough to host weddings and spiritual events",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Sant Bhagvant Sahebji Maharaj has created “Akshardham” on Earth! Relaxing and soothing environment as soon as we enter arena.\nSong of sculptures in Pink Stone and white marble..\nIdols of Bhagvan Swaminarayan - Santo and respected Mukto in temple - brings us close to glory of past. Inspired for future!\nNutan Mandir and Nij Mandir are place where we feel VIBES OF VISCINITY TO GOD..\nPeacocks - Parrots - Monkeys too find this place as “own home”! None bothered with or bothering our presence!\nDaily Arti and Bhajans playing in campus is an experience beyond explanation…\nWorth a visit to understand what Anoopam Path is created by SAFFRON HEARTED - KARMAYOGI SADHUs of SWAMINARAYAN SAMPRADAY",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "My family and I visited this beautiful Hindu temple.  The architecture is stunning, and the peace one feels is rejuvenating.\n\nDo visit the museum, and take time out to read the insightful messages curved on the pillars of the temple.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Great socio spiritual place. Disciplined, organized and dedicated volunteers.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "The atmosphere is very soothing and relaxing. Here you can feel the peace of nature,Chirping of birds especially peacocks. And the entire campus seems alive with divine music.You can feel one step closer to the almighty God here.The campus has its own school along with an IT centre to enrich the students behaviour, managed by Anoopam Mission. And the heart of the campus is temple of lord Swaminarayan.",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "spacious temple spiritual host weddings events wellmaintained enough",
                "daily campus parrots path viscinity pink temple explanation environment soon swaminarayan mukto created akshardham understand nutan arena bhagvan experience stone home bothering bothered sadhus nij respected bhajans feel relaxing soothing close beyond saffron god worth sampraday sculptures us find bhagvant maharaj santo earth peacocks song white glory inspired own vibes future karmayogi sahebji brings enter past monkeys playing arti visit marble none hearted mandir idols sant anoopam presence",
                "peace temple insightful hindu visited beautiful feels messages family stunning rejuvenating architecture museum curved read time pillars one take visit",
                "dedicated socio great spiritual disciplined volunteers organized",
                "almighty peace campus temple behaviour swaminarayan atmosphere school anoopam entire heart naturechirping centre birds feel herethe soothing relaxing alive god lord seems enrich divine students along peacocks one mission managed closer especially step musicyou"
            ]
        },
        {
            "name": "Sardar Patel Memorial, Karamsad",
            "rating": 4.5,
            "address": "17, Anand - Sojitra Rd, Phase -IV, Karamsad, Anand, Gujarat 388121, India",
            "reviews": [
                {
                    "text": "Must visit this memorial of great leader Sardar Shri Vallabhbhai Patel. Rare photographs of  Sardar are in gallery.  Beautifully landscaped garden.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Beautiful memorial at the birthplace of Sardar Patel ji. Nicely maintained",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "There is not much to view inside the  museum becoz it's still under construction, a documentary of the struggle was projected for half an hour later you can just walk around the place, the garden is simple yet beautiful. It's better to go after few months for spending a proper vacation. Have a good visit.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "I was gone in Garden in 2011 then after visited in 2024 i was surprised with the AC Hall. Because I didn't know that there is a Hall too in the Center of the Garden .",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "At Sardar Patel Memorial we have done branding work for many big shows\nAnd it was a lot of fun in that work and there was a lot of success and good experience in branding the event of Khadi Gram Udyog\nKhadhi Gram Udyog and Sardar Patel Memorial Team were very satisfied with our work.\nAnd we hope to have their cooperation in future also",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "garden patel sardar shri beautifully memorial great leader vallabhbhai gallery rare visit must landscaped photographs",
                "ji beautiful patel sardar memorial birthplace maintained nicely",
                "walk becoz much simple beautiful around months hour later vacation still go spending garden museum view proper better documentary good half projected struggle yet visit construction inside",
                "gone visited garden didnt know center ac surprised hall",
                "branding fun memorial satisfied cooperation shows many experience gram also khadi udyog lot khadhi sardar work success team good big hope patel future done event"
            ]
        },
        {
            "name": "Indira Gandhi Statue",
            "rating": 4.3,
            "address": "HW6W+GWV, Patel Chokdi, Vivekanand Wadi, Anand, Gujarat 388120, India",
            "reviews": [
                {
                    "text": "Nice Taste\nGood service\nComfortable sitting",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "There is no any ticket required for that.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "A very busy place",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "😀",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "One of the best statue since long time. Busy also",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "sitting taste nice comfortable service good",
                "required ticket",
                "busy",
                "",
                "since best long also statue busy time one"
            ]
        },
        {
            "name": "Shree Rokadiya Hanumanji Temple",
            "rating": 4.8,
            "address": "Talav, Gopalanand Swami Marg, near Goya, behind P.M Patel College, Rahtlav, Mathiya Chora, Anand, Gujarat 388001, India",
            "reviews": [
                {
                    "text": "It is a nice temple to visit, and parking is available on the street.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Blessed  by visit this temple.🙏 Temple authority is following proper COVID guideline. Seprate queue for Men and Women. The murti of Lord Hanuman is almost of Treta Yug was established by Nardji & Hanumanji himself as per the order of Shri Ram. Operated By Shir Swaminarayan Temple Vadtal Gaadi. Jay Swaminarayan and Jay Rokadiya Hanumanji Maharaj.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Today when the whole nation is chanting ram dhun i visited the rokadiya dev temple and they are playing swaminarayan dhun. I mean no offence but the temple committee should be mature enough to understand this. Even beside hanumanji there are banners of swaminarayan. I mean come on that is the place you found?\nNo offence to any god but hanuman temple feels more like a swaminarayan temple. Even they have a dedicated flag post to show the swaminarayan flag in the entrance. On the temple also multiple swaminarayan flags are flown. I was a visitor of the temple from my childhood for this temple but now such things really feel bad.",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "With utmost prominence among pilgrims and devotes, the popularity of Anand as a religious place remains intact. Among several other temples and shrines, there is one small but extremely prominent place of worship that is regarded as a place of profound spiritual sanctity that is Shri Rokadia Hanuman Mandir in Anand.\n\nRakodia Hanuman Temple is dedicated to lord Hanuman the Monkey God. The temple is located at the top of Hanuman of Tekro also called the Hanuman Hill. The temple was constructed by king Mayurdhwaj of Kheda. It is the one of the very few temples belonging to Swaminarayan Sampraday in which the central deity is not Hanuman. And this is the only temple in which the central deity is Lord Hanuman. In other temples where human gods are not the central deity, Hanuman idols are placed along with Lord Ganpati (the Elephant God).",
                    "languageCode": "en",
                    "rating": 4.8
                },
                {
                    "text": "Temple: Shree Hanumanji Dada\nLocation: On the edge of Gopi Talav, Anand\n\nStory:\nShri Bhagwan Swaminarayan along with his followers and saints visited here and gave upadesh to treat others with pity (daya),however they treat you badly.\nGopalanand swami had given shawl to Bhairav here.\nN that Bhairav dada turns into his original Hanumanji  Swaroop.\n\nPresently:\nNew construction is going on.\nYou can see beautiful artwork of stone with special bandhani of Shikhar gumbaj n flooring.\nMandir also have a small yagnashala with magnificent wood art work.\n\nSwaminarayan bhagwan life incidences are engraved on temple surrounding wallls with colors.\n\nMust visit for Swaminarayan devotees.",
                    "languageCode": "en",
                    "rating": 4.8
                }
            ],
            "preprocessed_reviews": [
                "parking temple nice visit street available",
                "temple men almost swaminarayan authority shir jay established hanumanji per operated nardji proper ram order lord rokadiya following yug treta vadtal murti shri guideline women queue visit hanuman gaadi covid blessed maharaj seprate",
                "nation post even temple multiple swaminarayan beside understand childhood flag visited feels entrance hanumanji dhun also today chanting things feel dev god ram rokadiya committee flown banners show offence flags whole mean visitor come playing like mature hanuman found bad really dedicated enough",
                "gods human profound idols placed spiritual temple top tekro swaminarayan worship called extremely shrines central kheda located popularity prominent religious also utmost monkey ganpati several among sanctity devotes regarded temples pilgrims constructed god sampraday small lord hill belonging prominence along one anand deity shri mayurdhwaj king rakodia elephant remains intact hanuman mandir rokadia dedicated",
                "treat location gumbaj temple gopalanand flooring talav swaminarayan magnificent incidences bhairav going visited turns beautiful hanumanji stone shikhar swaroop also bhagwan colors story new artwork art upadesh life special shawl surrounding wood followers given dada pity work bandhani small n must yagnashala badly devotees along others wallls anand shree edge gopi shri saints dayahowever presently swami engraved visit see construction mandir original gave"
            ]
        }
    ]
}