{
    "places_with_reviews": [
        {
            "name": "Bhavanarayana Swamy Temple.",
            "rating": 4.6,
            "address": "WF49+939, 13th Ward, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "Baptala's ancient Hindu temple stands as a city jewel, beckoning visitors to immerse themselves in its rich history and spiritual allure. A must-visit, it seamlessly blends the sacred with the urban, creating a unique experience for those exploring the heart of the city.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very ancient temple, dating back to 1000 years. Built by Kukothunga Chola.\nCholas Legacy continue till today.\nNeed to be developed more",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Very good temple. This was  built in 11th century time. Very few temples have in this historic back ground. I visited this temple and the  very peaceful environment here. The clock tower is very near to this temple. Here we have a good identity for this clock tower center from previous Decades of time. Recently re-built this clock tower for the old one has gone in a road extension. This new tower images are attached here....",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Sri Bhavanarayana Swamy Temple in Bapatla is very ancient temple with brilliant architecture. Some Sasanas are there in the temple. It is well maintained and worth visit.",
                    "languageCode": "en",
                    "rating": 4.6
                },
                {
                    "text": "Historical architecture of temple must visit it👍\nIt's cholas creation very long historical temple",
                    "languageCode": "en",
                    "rating": 4.6
                }
            ],
            "preprocessed_reviews": [
                "creating temple spiritual seamlessly baptalas rich blends sacred stands hindu experience immerse unique heart exploring city beckoning ancient urban allure history mustvisit visitors jewel",
                "continue chola developed kukothunga years back temple till built legacy need today dating cholas ancient",
                "back temple recently environment identity road peaceful previous old visited center century th rebuilt new temples clock images built decades time good extension near one historic gone attached ground tower",
                "bapatla brilliant sasanas architecture temple bhavanarayana worth swamy ancient visit maintained well sri",
                "architecture temple it long visit must historical creation cholas"
            ]
        },
        {
            "name": "Centenary Baptist Zion Church",
            "rating": 4.3,
            "address": "WF4F+27H, Srungarapuram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "Last time when I saw this church few years ago it wasn't this big. This church was pervious a very small one but it was rebuilt a few years ago.\nAnd now it's Huge.\nVery well built and very spacious.\nAlso it is situated beside the main road (GBC Road).\nVery good devotional place.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Awesome...loved the appearance. One of the oldest church in India. For sure it's a tourist attraction and a must visit place.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "This is the largest church in Bapatla. It is near to old busstand. And it is in the centre of Bapatla Town. It is also a tourist place.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Very nice chruch surrounding area is beautiful with plants,inside chruch is spacious and simple design.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Very Famous And Big Church in Bapatla District",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "pervious road gbc beside saw last situated devotional ago also church wasnt rebuilt huge spacious years small built main big time good well one",
                "tourist appearance awesomeloved india church must visit oldest sure attraction one",
                "bapatla near town tourist also centre church busstand old largest",
                "beautiful spacious area nice design simple plantsinside chruch surrounding",
                "famous bapatla church big district"
            ]
        },
        {
            "name": "Clock Tower",
            "rating": 4.2,
            "address": "WF39+H65, NH216, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "the current clock tower is reconstructed in memory of the historical tower by moving it little back to help widening road. I never seen the tower not working for the purpose its built and quite good landmark and sort of center of the most commercial area in bapatla.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "White elephant. Money wasted.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Clock tower is good, it is actually famous for badam milk point near by it. But I suggest not to drink badam milk there because it is no different than the one you can get in readymade bottle.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "Clock tower situated in heart of the town. Nicely renovated and looking good. A prominent landmark in Bapatla town. Memorial place of Bapatla.",
                    "languageCode": "en",
                    "rating": 4.2
                },
                {
                    "text": "It is a well known center in Bapatla city where you can find every shop you can every thing good market place .....",
                    "languageCode": "en",
                    "rating": 4.2
                }
            ],
            "preprocessed_reviews": [
                "sort memory back road little historical bapatla quite center commercial landmark moving current widening area clock reconstructed built good never seen purpose tower help working",
                "money wasted white elephant",
                "actually famous different point milk tower clock suggest readymade bottle good drink get badam near one",
                "situated bapatla heart looking prominent memorial tower clock landmark good nicely renovated town",
                "bapatla shop good known center city find thing every market well"
            ]
        },
        {
            "name": "Ambedkar Statue",
            "rating": 4.3,
            "address": "WF38+HVC, Bapatla - Jammulapalem Flyover, Sharab Bazar, Christ Nagar, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "Great place to learn about ambedkar and good location for timepass at middle of the city",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "In bapatla 32 feet dr b r ambetkar statue\nIn asia only one bigest Dr br ambetkar statue is hear",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It's a statue of Dr. B. R. Ambedkar in the entrance of the flyover .",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Big statue of Dr.BR Ambedhkar",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "ambedkar location timepass great city good learn middle",
                "bapatla asia ambetkar b statue br bigest hear dr r feet one",
                "entrance ambedkar b statue flyover dr r",
                "good",
                "drbr ambedhkar statue big"
            ]
        },
        {
            "name": "Karralapalem",
            "rating": 1,
            "address": "WF39+H7R, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "agriculture college statue",
            "rating": 4.5,
            "address": "WF29+3X3, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "AG College - statue in one of the iconic agricultural college will all Afro based studies.",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "It is one of the oldest agriculture college in Andhra pradesh  and still maintaining high standards in teaching  and practical work..we are really proud of  this institute..",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "Oldest. Agricultural college in india\nIn 19 century college ,verry very largest college ,\nIts looking a British stone degining is good.\nVery big place is for farming ..\n\nNice place",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "This statue is a torch bearers statue locates at the entrance of govt agricultural college bapatla.. This statue is excellently sculptured being bapatla as one of the best colleges in ap.. A photo site for the visitors",
                    "languageCode": "en",
                    "rating": 4.5
                },
                {
                    "text": "One of the best agricultural colleges in India\nBest teaching faculty and aid.",
                    "languageCode": "en",
                    "rating": 4.5
                }
            ],
            "preprocessed_reviews": [
                "agricultural ag studies based college statue iconic afro one",
                "standards maintaining high college institute pradesh workwe really teaching agriculture oldest still practical proud andhra one",
                "agricultural college stone looking largest good british india century degining nice big oldest farming verry",
                "agricultural bapatla entrance bearers best college site torch visitors locates sculptured statue govt excellently colleges photo ap one",
                "agricultural best aid india colleges faculty teaching one"
            ]
        },
        {
            "name": "Suryalanka beach",
            "rating": 5,
            "address": "WF38+HVC, Sharab Bazar, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [],
            "preprocessed_reviews": []
        },
        {
            "name": "Sivalayam Temple",
            "rating": 4.3,
            "address": "WF49+985, 13th Ward, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "This is very ancient Shiva temple, dating back to the Chola period. The vast court yard also has the Ayyappa Bhajana Mandali,  which offers food for devotees during Ayyappa season. Good vibe.   Very near to the Railway station.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "the temple maintenance are damn waste there are many ways to visit to lord shiva but some unusual temple volunteers don’t know how to maintain. Queue line inside the temple most devotees are felt inconvenience because of the conjust area so keep concentrate on devotees and cooperate",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good quality and taste super 👌",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It's really beautiful. One of the best spiritual place, More free space available can spend some time and enjoy the magic of nature",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Good vibes in the temple, a must visit in bapatla",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "vast back temple vibe dating chola also court station ancient railway shiva mandali offers devotees good food bhajana near season yard period ayyappa",
                "unusual temple damn conjust felt inconvenience keep many cooperate don shiva area concentrate waste lord maintenance maintain devotees line volunteers t ways know queue visit inside",
                "taste quality super good",
                "nature beautiful available best enjoy spend spiritual magic free time really space one",
                "bapatla vibes temple visit must good"
            ]
        },
        {
            "name": "Poleramma Temple",
            "rating": 4.3,
            "address": "WF38+GH9, Maddiboinavaripalem, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "Out of Millions of local deities, she is our ancestral diety.\nThe temple was planned to demolish for road extension. But concerned authorities backed out after the consequences. Dont ask if i have witnessed them. Proof for me is the temple still out there",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Poleramma! Goddess Poleramma is a Pre Vedic deity goddess, who is predominantly worshipped in the state of Andhra Pradesh. Poleramma is a local form of Sakti in Andhra pradesh. She is worshipped as Grama devata, Goddess who protects the village. Very powerful as per the rural people of Andhra Pradesh. Mother Poleramma is worshipped as a village guardian goddess to protect the village. The shrine is usually kept outside the village",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "Very powerful and popular goddess of bapatla town and once upon a time it is the starting point for town",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It's a temple for devoting Durgamma goddess. It's has been built a decades ago. It's is known to everyone in bapatla.",
                    "languageCode": "en",
                    "rating": 4.3
                },
                {
                    "text": "It does not have place to sit to worshipping the goddess as it settles beside the guntur-chirala highway",
                    "languageCode": "en",
                    "rating": 4.3
                }
            ],
            "preprocessed_reviews": [
                "deities diety ask temple road ancestral backed authorities still local millions concerned demolish witnessed planned proof extension dont consequences",
                "poleramma pre protect shrine protects predominantly guardian form village per local vedic grama outside sakti people goddess powerful mother devata andhra deity usually state pradesh worshipped kept rural",
                "bapatla point starting upon popular goddess time powerful town",
                "bapatla ago devoting temple known everyone built decades goddess durgamma",
                "worshipping sit beside highway goddess gunturchirala settles"
            ]
        },
        {
            "name": "Sai baba temple",
            "rating": 4.7,
            "address": "Near new, bus stand, GBC Rd, Satyannarayana Puram, Bapatla, Andhra Pradesh 522101, India",
            "reviews": [
                {
                    "text": "A Holy Temple. Situated near APSRTCBus stand Bapatla. Several devotees daily visit the temple and offer prayers. Good facilities arranged for bhaktaas. Prasad am of Swamy will be distributed to them. Every day food/meals will be given to poor people and beggars. Opened from 5am to9pm. Good place and located on the high way. Every Thursday special poojas will be performed.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Most famous temple\nVery near to new bus stand bapatla\nOne of the most visiting place among all the temples located in town\nBaba statue seems same as it is in shiridi\nEnough place to do pradakshanas\nNot very pleasent because it is side by main road\nBut once you enter the temple you will forget all those .",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "From my home town and visiting this temple gives lot of comfort and peaceful mind. It's regular temple to offer prayers.",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "It is one of the famous temples in Bapatla and is one of the few Saibaba temples in Andhra pradesh...i feel happy to have my home near to this temple",
                    "languageCode": "en",
                    "rating": 4.7
                },
                {
                    "text": "Sai Baba Temple, beside Old Bus Stand, Near to Patel Nagar, Peaceful Place.",
                    "languageCode": "en",
                    "rating": 4.7
                }
            ],
            "preprocessed_reviews": [
                "daily performed arranged distributed temple poojas day facilities situated bapatla high poor located apsrtcbus opened several every special given beggars thursday offer holy prayers devotees people way good stand near foodmeals prasad bhaktaas topm swamy visit",
                "temple road famous bapatla visiting located shiridi bus statue new among pradakshanas forget temples seems main stand near one pleasent enter side baba town enough",
                "visiting gives temple home offer peaceful comfort regular prayers lot town mind",
                "famous bapatla near temples temple home happy saibaba pradeshi feel andhra one",
                "near patel temple bus nagar peaceful sai beside baba stand old"
            ]
        }
    ]
}